import streamlit as st

def experience_page():
    st.markdown("## 实习与项目经历")

    st.markdown("### 实习经历")
    with st.expander("点击展开/收起", expanded=True):
        st.markdown("""
        #### 安克创新科技股份有限公司（深圳）
        - **职位**: 声阔CN-MKT-实习生
        - **时间**: 2025.04 - 2025.06
        - **主要职责**:
            - **达人建联**: 负责声阔品牌开放式耳机产品小红书平台KOC达人的提报与建联，为618大促蓄水+品牌曝光；于蒲公英平台筛选性价比高且风格合适的koc达人提报审核，提报通过率约80%；提报通过后积极与达人建联促合作，月均BD合作次数50+。
            - **内容产出**: 负责达人合作brief制作，精准传递品牌方内容要求，共计制作达人brief约10份；负责达人合作图文、视频内容审核，保证发文质量并开发爆文；实习期间月均发文数50+，总共产出5篇点赞500+爆文，其中2篇破千赞。
            - **达人投流**: 负责日常监控KOC笔记投流数据，通过不同维度下钻数据分析CPC、CPE、CPUV等指标异动归因，并优化调整投放策略同步投流代理侧；根据小红书站内前端数据、小红星（淘宝）站外转化数据，挖掘表现优异的KOC笔记提报上线测试；实习Q2期间产品CPC下降约6%，CPUV约下降9%，ROI提高约8%。
        
        ---

        #### Publicis-G4 | 阳狮（北京）文化传播有限公司
        - **职位**: 客户执行实习生
        - **时间**: 2024.03 - 2024.05
        - **主要职责**:
            - **品牌传播**: 参与雀巢品牌传播策略，负责雀巢2024年中秋Campaign活动，通过分析10+个竞品的中秋传播策略，提出"中国味，团圆意"为主题的主题传播方案，配合Agency完成后续媒介投放、宣发等工作，全平台传播累计触达20w+。
            - **达人投放**: 负责对接雀巢母婴平台营销工作，根据学生群体画像找寻合适的KOL进行调研和筛选，与20+KOL进行商务合作方案，其中与多位达人的传播投放量达2w次。负责媒介投放工作，与微博、京东、天猫等多个平台进行投放。
            - **竞品分析**: 负责雀巢品牌系列产品竞品分析工作，负责不同产品线竞品营销策略分析并完成月度/季度Brief，作为团队核心成员参与新品上市传播的支撑。
            - **客户支持**: 日常参与调研策略、美术、文案工作，累计撰写Debrief 50+次，修改100余Deck，参与和客户的会议并输出会议纪要和客户。

        ---

        #### 浙江怡联网络科技股份有限公司 | 产品经理助理
        - **职位**: 研发部 | 产品实习生
        - **时间**: 2024.07 - 2024.08
        - **主要职责**:
            - **平台产品开发**: 参与"招商云"To B类型项目，通过调研和分析"招商银行"等管理信息系统，结合客户需求，明确"AR实景看铺"等功能建设的方向。参与产品一期迭代工作，推动初代产品上线。
            - **解决方案**: 结合项目二期规划，参与优化、修改"招商云"项目产品优化方案，通过系统逻辑梳理用户优化需求，为后续迭代客户功能和用户体验提供依据，提高产品可用性和ROI。
            - **产品运营**: 负责撰写相关产品交互文档，制作"招商云"项目路演PPT和用户操作手册，并基于当前及客户情况，便于其进行客户宣传。
        """)

    st.markdown("### 项目经历")
    with st.expander("点击展开/收起", expanded=True):
        st.markdown("""
        #### YEAP — AI赋能的个性化教育辅助平台（北京云景羽涵科技有限公司）
        - **职位**: 产品&市场负责人
        - **时间**: 2021.09 - 2022.10
        - **项目背景**: “YEAP泽谱”，旨在通过AI技术构建集音乐教学、工具、社群于一体的在线教育平台，解决线上教学及教育资源不平衡的问题。
        - **需求调研**: 通过对目标用户的需求调研（收集400+份），发现一部分学生对现有在线学习的需求，以及学生对学习成本及教育资源的需求，为产品设计提供策略支持。
        - **产品设计**: 参与设计平台功能，主要完成AI咨询功能，基于YOLOv5算法实现线上咨询与简历诊断，支持图片上传与语音识别功能，降低用户学习难度；参与搭建AI聊天agent，以"小研"为用户个性化引导、智能辅助与学习规划。同时，负责完成在线课程和个性化社区建设，提高用户活跃度及分享交流。
        - **市场推广**: 负责平台商业化方案撰写，以内容创作、社群运营、广告、合作等为核心进行运营。负责公司商业计划书撰写，与北京东方红创新科技有限公司达成合作，以"点亮繁星"公益活动，进行推广。项目获"京彩大创" "互联网+北京赛区"等国家级/市级奖项，累计融资超5万用户。全校范围推广业务覆盖4w+，项目获学校投资25w+。

        ---


        #### “正大杯”全国大学生市场调研大赛——西安夜间经济市场调研
        - **职位**: 项目负责人
        - **时间**: 2023.01 - 2024.04
        - **主要职责**:
            - **调研设计**: 设计爬取微博10万条调研问卷、大纲，包括抓取、清洗、分析的流程，定性、定量分析的流程；
            - **定性分析**: 基于Python Selenium和nltk库自动抓取微博文本数据，结合LDA主题模型、情感分析，产出词云图作为研究成果；
            - **定量分析**: 负责回收数据的清洗分析，包括K-means聚类、SEM结构方程模型、Logistic回归等数理分析模型的核心影响因素；
            - **【主要成果】**: 100+项专利5万份调查报告，主要面向北京市27所高校，国家级/市级奖项。
        """)

if __name__ == "__main__":
    experience_page()